[{"title":" Hello World!(你好！世界！)","pathName":"Hello_World.mdx","content":"Markdown语法测试文档(GeneratedbyAI)中日英测试文案中文：你好，这是一个中文测试文案。日文：こんにちは、これは日本語のテスト文書です。英文：Hello,thisisanEnglishtestdocument.二级标题三级标题四级标题五级标题六级标题文本样式粗体文本斜体文本删除线文本黑幕代码文本列表无序列表列表项1列表项2列表项3有序列表列表项1列表项2列表项3链接与图片链接百度谷歌图片MarkdownLogo引用这是一个引用文本。代码块//[!codeword:Hello]functiongreet(){console.log('HelloWorld!');}仅作长代码高亮演示fromjsonimportdumpsimporttime//[!code--]fromtimeimportsleep//[!code++]fromrequestsimportgetfromreimportfindall,compileforiinrange(0,len(origin_list)//5):item={}#[!codeerror]item['characterName']:str=compile(r'title=\"(.*?)\"').findall(origin_list[i*5+1])[0]print(item['characterName']+'Getting...',end='')item['characterId']:str=compile(r'/character/(\\d+)').findall(origin_list[i*5+1])[0]item['characterAvatar']:str='https:'+compile(r'').findall(origin_list[i*5+1])[0]characterInfo=get(api_url+'/v0/characters/'+item['characterId'],headers=headers).json()item['characterImg']:dict=characterInfo['images']item['characterSummary']:str=characterInfo['summary'].replace(r'\"',r'\\\"')item['characterInfo']:list=characterInfo['infobox']processed=processed+dumps(item).replace(r'\\n','').replace(r'\\r','')+'\\n'print('Done.')sleep(sleep_time)表格|名称|价格||---|---||商品1|$10||商品2|$20||商品3|$30|分割线脚注这是一个带脚注的句子。:这是一个脚注的内容。数学公式$a^2+b^2=c^2$remarkBili[bilibili|BV1qm421s7MR][bilibili|BV1qm421s7MR]","tags":" ['hello world','test']"},{"title":" CESO学习笔记","pathName":"ceso_note.mdx","content":"2.5就要测试的啥b在1月的最后几天开始学地质学常识地图等积投影：表示正确面积关系的地图总是使区域的形状失真。一张地图不可能既是等积的又是正形的。map此图使用鲁滨逊投影，是为了以视觉上满意的方式表现世界而设计的，既不是等积的也不是正形的。地图类型多用途地图、基准地图（referencemap）或位置图的主要目的是展示一个地区或全世界的一种或几种自然要素和（或）文化要素。地图上表现的自然要素一般为水文要素（海岸线、河流、湖泊等）以及地形的形状和高程。文化要素包括交通线路、居民区、地产界线、政治界线和地名（toponym）等。“专题地图”（thematicmap）或“特种地图”，是一类表现特定事物空间分布或某种数据的地图。制图的对象也可能是自然要素（气候、植被、土壤等）和（或）文化要素（例如，人口、宗教、疾病或犯罪的分布等）。不同于基准地图，专题地图仅限于显示某些特定事物的空间分布。水平位置和垂直位置共同构成大地测量控制数据（geodeticcontroldata）。GIS数据输入部分：把地图和其他数据从其现存形式转变为数字形式或计算机可读的形式；数据管理部分：用以储存和提取数据；数据操作功能：允许来自异源的数据能同时被使用；分析功能：能够从数据中提取有用信息；数据输出部分：使形象化的地图和表格显示在计算机显示器或硬拷贝上（如打印在纸上）。岩石火成岩喷出岩：玄武岩、浮岩、黑曜岩（呈玻璃质）侵入岩：花岗岩沉积岩有些**沉积岩是由已经存在的岩石侵蚀（erosion）下来的砾石、砂粒、粉砂和黏土形成的。地表水（surfacewater）将沉积物携带到海洋、沼泽、湖泊，或者潮汐盆地中。这些物质受到叠加在其上部的沉积物的重力压实作用，以及由水和某些矿物的化学活动所产生的胶结作用，就形成了沉积岩。逐渐形成的一层层的沉积岩称为地层按颗粒大小从大到小：砾岩>砂岩>页岩生物的骨骼等固结成岩，形成石灰岩。变质岩石灰岩->大理岩花岗岩->片麻岩页岩->板岩《普通地质学》绪论地球由固体地球和覆盖其上的水圈、生物圈和大气圈组成。固体地球又分为地壳、地幔和地核（外核液态，内核固态）。地壳平均厚度30~40km，古登堡界面（核-幔边界）：2900km地质作用分为内力与外力作用内力作用主要以地球内热为能源、主要发生在固体地球内部，包括：岩浆作用、构造作用、地震作用、变质作用、地球各圈层相互作用外力作用主要以太阳能及日月引力为资源并通过大气、水、生物因素引起，包括地质体的风化作用、重力滑动作用以及各种地壳表层载体（河流、冰川、地下水、海水、湖泊、风沙）的剥蚀作用、搬运作用、沉积作用、固结成岩作用研究方法：1.野外调查2.仪器测量3.理论分析矿物（考的少矿物凝灰岩2~50mm，火山砾->火山角砾岩\\>50mm，火山块->火山集块岩呈纺锤状，火山弹气体快速逃逸，浮岩c.气体两种喷发方式裂隙式喷发中心式喷发喷出作用条件地壳运动岩浆黏度大。黏度大-小，爆发象-溢流象，酸性-基性（典型：玄武岩）按二氧化硅含量对喷出岩浆分类65%：酸性岩浆《黏度最大超基性岩熔岩代表：科马提岩橄榄石晶体发育被辉石微晶集合体充填的裂缝，形成典型的鬣刺结构科马提岩基性熔岩代表：玄武岩陆地喷发有柱状节理，海底喷发的枕状构造(地面平的，顶上凸的)枕状熔岩中性熔岩代表：安山岩黏性大，发育气孔构造。气孔被矿物充填称杏仁体石英杏仁体酸性岩浆代表：流纹岩黏度最大，爆发性，易形成火山锥侵入作用与侵入岩围岩：包围侵入体的原有岩石侵入体按深度区分：\\>10km深成侵入体3~10km中深成侵入体\\<3km浅成侵入体多样性火成岩多样性（基性|岩性）原因i.在岩浆通道周围发生同化作用：侵入体规模足够大，将围岩吞噬混染作用：侵入体规模不够大，围岩物质改变岩浆成分（捕虏体：混染作用中被捕虏的围岩碎块；顶垂体：未被岩浆吞噬的围岩）ii.岩浆混合作用（$eg.$酸性花岗岩浆混合基性玄武岩浆）iii.拆沉作用：岩石圈物质在下沉时伴随脱水，导致密度不断增大，当密度大于软流圈密度时，岩石圈重力失衡，下部断裂掉入软流圈。拆沉的岩石圈使软流圈体积增大，密度下降。引起岩浆上涌或软-岩界面抬升，融化岩石圈基性岩iv.结晶分异作用特点：熔点高，密度大的矿物先结晶导致岩浆成分不断改变，出现垂直分带垂直分带·鲍温反应系列连续系列：浅色不连续：暗色火成岩的结构与构造不等粒结构中细小者称基质，粗大者称斑晶。火成岩的构造：块状构造流动构造：流纹岩典型，气孔拉长，异色条带与之平行气孔构造与杏仁构造：典型玄武岩，前者指岩石发育的球形的气体占据的空间，基性熔岩气孔大圆，酸性反之。杏仁构造指气孔被矿物充填者。枕状构造球状构造晶洞构造层状构造","tags":" [\"note\", \"CESO\"]"},{"title":" 吉他练习谱","pathName":"guitar.mdx","content":"Day1右手拨片拨弦练习【木吉他新手右手拨片专项训练课】https://www.bilibili.com/video/BV1XywNeNESe/Tempo=60在两个音换弦image.png在三个音换弦image.png","tags":" [\"record\",]"},{"title":" 读书的艺术","pathName":"my_sight_of_education.mdx","content":"偶然间读到了这篇林语堂先生做的文章，觉得经过了这么几十年，其思想还是特别贴切，故转载如下读书的艺术诸位，兄弟今日重游旧地，以前学生生活苦乐酸甜的滋味，都一一涌上心头。不但诸位所享弦诵的快乐，我能了解，就是诸位有时所受教员的委曲磨折，注册部的挑剔为难，我也能表同情。兄弟今日仍在读书时期，所不同者，不怕教员的考试，无虑分数之高低，更无注册部来定我的及格不及格，升级不升级而已。现就个人所认为理想的方法，与诸位学友通常的读书方法比较研究一下。余积二十年读书治学的经验，深知大半的学生对于读书一事，已经走入错路，失了读书的本意。读书本来是至乐之事，杜威说，读书是一种探险，如探新大陆，如征新土壤；佛兰西也已说过，读书是“魂灵的壮游”，随时可以发见名山巨川，古迹名胜，深林幽谷，奇花异卉；到了现在，读书已变成仅求幸免扣分数留班级一种苦役而已。而且读书本来是个人自由的事，与任何人不相干，现在你们读书，已经不是你们的私事，而处处要受一些不相干的人的干涉，如注册部及你们的父母妻室之类。有人手里拿一书本，心里想我将何以赡养父母，俯给妻子，这实在是一桩罪过。试想你们看《红楼梦》，《水浒》，《三国志》，《镜花缘》，是否你们一己的私事，何尝受人的干涉，何尝想到何以赡养父母，俯给妻子的问题？但是学问之事，是与看《红楼梦》，《水浒》相同。完全是个人享乐的一件事。你们若不能用看《红楼梦》，《水浒》的方法去看《哲学史》，《经济学大纲》，你们就是不懂得读书之乐，不配读书，失了读书之本意，而终读不成书。你们能真用看《红楼梦》，《水浒》的方法去看哲学，史学，科学的书，读书才能“成名”。若用注册部的方法读书，你们最多成了一个“学士”“博士”，成了吴稚晖先生所谓“洋绅士”，“洋八股”。我认为最理想的读书方法，最懂得读书之乐者，莫如中国第一女诗人李清照及其夫赵明诚。我们想象到他们夫妇典当衣服，买碑文水果，回来夫妻相对展玩咀嚼的情景，真使我们向往不已。你想他们两人一面剥水果，一面赏碑帖，或者一面品佳茗，一面校经籍，这是如何的清雅，如何得了读书的真味。易安居士于《金石录后序》自叙他们夫妇的读书生活，有一段极逼真极活跃的写照；她说“余性偶强记，每饭罢坐归来堂，烹茶指堆积书史，言某事在某书某卷第几页第几行，以中否角胜负，为饮茶先后。中即举杯大笑，至茶倾覆怀中，反不得饮而起，甘心老是乡矣!故虽处忧患困穷，而志不屈，……收藏既富，于是几案罗列，枕席枕藉，意会心谋，日往神授，乐在声色狗马之上。……”你们能用李清照读书的方法来读书，能感到李清照读书的快乐，你们大概也就可以读书成名，可以感觉读书一事，比巴黎跳舞场的“声色”，逸园的赛“狗”，江湾的赛“马”有趣。不然，还是看逸园赛狗，江湾赛马比读书开心。什么才叫做真正读书呢？这个问题很简单，一句话说，兴味到时，拿起书本来就读，这才叫做真正的读书，这才是不失读书之本意。这就是李清照的读书法。你们读书时，须放开心胸，仰视浮云，无酒且过，有烟更佳。现在课堂上读书连烟都不许你抽，这还能算为读书的正轨吗？或在暮春之夕，与你们的爱人，携手同行，共到野外读《离骚经》，或在风雪之夜，靠炉围坐，佳茗一壶，淡巴菰一盒，哲学经济诗文，史籍十数本狼藉横陈于沙法之上，然后随意所之，取而读之，这才得了读书的兴味。现在你们手里拿一书本，心里计算及格不及格，升级不升级，注册部对你态度如何，如何靠这书本骗一只较好的饭碗，娶一位较漂亮的老婆——这还能算为读书，还配称为“读书种子”吗？还不是沦为“读书谬种”吗？有人说，如林先生这样读书方法，简单固然简单，但是读不懂如何，而且成效如何？须知世上决无看不懂的书，有之便是作者文笔艰涩，字句不通，不然便是读者的程度不合，见识未到。各人如能就兴味与程度相近的书选读，未有不可无师自通，或事偶有疑难，未能遽然了解，涉猎既久，自可融会贯通。试问诸位少时看《红楼梦》，《水浒》何尝有人教，何尝翻字典，你们的侄儿少辈现在看《红楼梦》，《西厢记》，又何尝须要你们去教？许多人今日中文很好，都是由看小说《史记》得来的，而且都是背着师长，偷偷摸摸硬看下去，那些书中不懂的字，不懂的句，看惯了就自然明白。学问的书也是一样，常看下去，自然会明白，遇有专门名词，一次不懂，二次不懂，三次就懂了。只怕诸位不得读书之乐，没有耐心看下去。所以我的假定是学生会看书，肯看书，现在教育制度是假定学生不会看书，不肯看书。说学生书看不懂，在小学时可以说，在中学还可以说，但是在聪明学生，已经是一种诬蔑了。至于已进大学还要说书看不懂，这真有点不好意思吧!大约一人的脸面要紧，年纪一大，即使不能自己喂饭，也得两手搿一只饭碗硬塞到口里去，似乎不便把你们的奶妈干娘一齐都带到学校来给你们喂饭，又不便把大学教授看做你们的奶妈干娘。至于“成效”，我的方法可以包管比现在大学的方法强。现在大学教育的成效如何，大家是很明了的。一人从六岁一直读到二十六岁大学毕业，通共读过几本书？老实说，有限得很。普通大约总不会超过四五十本以上。这还不是跟以前的秀才举人相等？从前有一位中了举人，还没听见过《公羊传》的书名，传为笑话。现在大学毕业生就有许多近代名著未曾听过名字，即中国几种重要丛书也未曾见过。这是学堂的不是，假定你们不会看书，因此也不让你们有自由看书的机会。一天到晚，总是摇铃上课，摇铃吃饭，摇铃运动，摇铃睡觉。你想一人的精神是有限的，从八点上课一直到下午四五点，还要运动，拍球，哪里还有闲工夫自由看书呢？而且凡是摇铃，都是讨厌，即使摇铃游戏，我们也有不愿意之时，何况是摇铃上课？因为学堂假定你们不会读书，不肯读书，所以把你们关在课堂，请你们静坐，用“注射”“灌输”的形式，由教员将知识注射入你们的脑壳里。无如常人头颅都是不透水的，所以知识注射普通不大成功。但是比如依我方法，假定你们是会看书，要看书，由被动式改为发动式的，给你们充分自由看书的机会，这个成效如何呢？间尝计算一下，假定上海光华，大夏或任何大学有一千名学生，每人每期交学费一百圆，这一千名学费已经合共有十万圆。将此十万圆拿去买书，由学校预备一间空屋置备书架，扣了五千圆做办公费（再多便是罪过），把这九万五千圆的书籍放在那间空屋，由你们随便胡闹去翻看，年底拈阄分配，各人拿回去九十五圆的书，只要所用的工夫与你们上课的时间相等，一年之中，你们学问的进步，必非一年上课的成绩所可比。现在这十万圆用到哪里去，大概一成买书，而九成去养教授，及教授的妻子，教授的奶妈，奶妈又拿去买奶妈的马桶，这还可以说是把你们的“读书”看做一件正经事吗？假定你们进了这十万圆书籍的图书馆，依我的方法，随兴所之去看书，成效如何呢？有人要疑心，没有教员的指导，必定是不得要领，杂乱无章，涉猎不精，不求甚解。这自然是一种极端的假定，但是成绩还是比现在大学教育好。关于指导，自可编成指导书及种种书目。如此读了两年可以抵过在大学上课四年。第一样，我们须知道读书的方法，一方面要几种精读，一方面也要尽量涉猎翻览。两年之中能大概把二十万圆的书籍，随意翻览。知其书名作者内容大概，也就不愧为一读书人了。第二样，我们要明白，学问的事，决不是如此呆板。读书必求深入，而欲求深入，非由兴趣相近者入手不可。学问是每每互相关联的。一人找到一种有趣味的书，必定由一问题而引起其他问题，由看一本书而不得不去找关系的十几种书，如此循序渐进，自然可以升堂入室，研磨既久，门径自熟；或是发见问题，发明新义，更可触类旁通，广求博引，以证己说，如此一步一步的深入，自可成名。这是自动的读书方法。较之现在上课听讲被动的方法，如东风过耳，这里听一点，那里听一点，结果不得其门而入，一无所获，强似多多了。第三，我们要明白，大学教育的宗旨，对于毕业的期望，不过要他博览群籍而已（beawell-readman），并不是如课中所规定，一定非逻辑八十分，心理七十五分不可，也不是说心理看了一百八十三页讲义，逻辑看了二百零三页讲义，便算完事。这种的读书，便是犯了孔子所谓“今汝画”的毛病。所谓博览群籍，无从定义，最多不过说某人“书看得不少”某人“差一点”而已，哪里去定什么限制？说某人“学问不错”，也不过这么一句话而已，哪里可以说某书一定非读不可，某种科目是“必修科目”。一人在两年中翻览这二十万圆的书籍，大概他对于学问的内容途径，什么名著杰作版本，笺注，总多少有一点把握了。现在的大学教育方法如何呢？你们的读书是极端不自由，极端不负责。你们的学问不但有注册部定标准，简直可以称斤两的，这个斤两制，就是学校的所谓“七十八分”“八十六分”之类，及所谓多少“单位”。试问学问之事，何得称量斤两？所谓英国史七十八分，逻辑八十六分，如何解释？一人的逻辑，怎么叫做八十六分？且若谓世界上关于英国史的知识你们百分已知道了七十八分，世上岂有那样容易的事？但依现在制度，每周三小时的科目算三单位，每周二小时的科目算二单位，这样由一方块一方块的单位，慢慢堆叠而来，叠成多少立方尺的学问，于是某人“毕业”，某人是“秀士”了。你想这笑话不笑话？须知我们何以有此大学制呢？是因为各人要拿文凭，因为要拿文凭，故不得不由注册部定一标准，评衡一下，就不得不让注册部来把你们“称一称”。你们如果不拿文凭，便无被称之必要。但是你们为什么要文凭呢？说来话长。有人因为要行孝道，拿了父母的钱，心里难过，于是下定决心，要规规矩矩安心定志读几年书，才不辜负父母一番的好意及期望。这个是不对的，与遵父母之命媒妁之言恋爱女子一样的违背道德。这是你们私人读书享乐的事，横被家庭义务的干涉，是想把真理学问孝敬你们的爸爸妈妈老太婆。只因真理学问，似太渺茫，所以还是拿一张文凭具体一点为是。有人因为想要得文凭学位，每月可以多得几十块钱使你们的亲卿爱卿宁馨儿舒服一点。社会对你们的父母说，你们儿子中学毕业读了三十本书，我可给他每月四五十圆，如果再下二千圆本钱再读了三十本书，大学毕业，我可给他每月八九十圆。你们父母算盘一打，说“好”，于是议成，而送你们进大学，于是你们被称，拿文凭，果然每月八九十圆到手，成交易。这还不是你们被出卖吗？与读书之本旨何关，与我所说读书之乐又何关？但是你们不能怪学校给你们称斤两，因为你们要向他拿文凭，学堂为保持招牌信用起见，不能不如此。且必如此，然后公平交易，童叟无欺。处于今日大规模生产品（massproduction）之时期，不能不划定商货之品类（standardizationofproducts），学问既然成为公然交易的商品，秀士，硕土，博土既为大规模生产品之一，自然也不能不“划定”一下。其实这种以学问为交易之事，自古已然。子张学干禄；子曰“三年学，不至于谷，未易得也。”（关于往时“生员”在社会所作的孽，可参观《亭林文集·生员论》上中下三篇。）到了这个地步，读书与入学，完全是两件事了，去原意远矣。我所希望者，是诸位早日觉悟，在明知被卖之下，仍旧不忘其初，不背读书之本意，不失读书的快乐，不昧于真正读书的艺术。并希望诸位趁火打劫，虽然被卖。钱也要拿，书也要读，如此就两得其便了。","tags":" [\"thoughts\",]"},{"title":" Windows 下 Bun install 很慢解决方法","pathName":"slow_bun.mdx","content":"由于设置代理后Bun会报错，只能全局换成国内源。notepad$HOME\\.bunfig.toml新建文件->粘贴以下内容[install]registry=\"https://registry.npmmirror.com/\"","tags":" [\"solution\",]"},{"title":" GithubActions在一个推送时触发另一个仓库的workflow","pathName":"trigger_another_repos_workflow.mdx","content":"实现思路是在子仓库推送时使用Github的RESTapi触发某个workflow。使用场景将博文和hexo等generator的sourcecode分开，方便管理（不是很方便，且如果博文全公开不建议这样做在private的submodule里做修改后，mainrepo进行构建方法首先在private的A仓库根目录中创建scripts/trigger.mjs，填入具有workflow权限的token，本地调试需要运行npminstalloctokit，注意：被触发的workflow中必须带有workflow_dispatch:以保证能被主动触发`js//Octokit.js//https://github.com/octokit/core.js#readmeimport{Octokit}from\"octokit\"constoctokit=newOctokit({auth:'ghp_XXXXXXXXXXXXXXXXXXXXXXXXXXXXX'})awaitoctokit.request('POST/repos/{owner}/{repo}/actions/workflows/{workflow_id}/dispatches',{owner:'YOUR-ID',repo:'YOUR-REPO',workflow_id:'',//这里填写public的B仓库中触发的工作流文件，如build.ymlref:'main',headers:{'X-GitHub-Api-Version':'2022-11-28'}})`创建工作流.github/workflows/push.yml以触发脚本，替换token为至少具有此仓库访问权限的token，你也可以写进secret。`ymlname:upstream_triggeron:push:jobs:trigger:runs-on:ubuntu-lateststeps:name:Checkoutrepocontentuses:actions/checkout@v3with:token:'ghp_XXXXXXXXXXXXXXXXXXXXXXXXXXXXX'name:SetupNodeuses:actions/setup-node@v3with:node-version:'18.12.1'cache:npmname:Installdependenciesrun:npminstalloctokitname:Runscriptrun:|nodescripts/trigger.mjs`如果A仓库是B仓库的submodule的话，B仓库的workflow推荐这样写，不过也有缺点，每次得记得在本地gitpull`ymlname:buildon:workflow_dispatch:jobs:build:runs-on:ubuntu-lateststeps:uses:actions/checkout@v3with:submodules:'true'token:${{secrets.ghtoken}}name:UpdateSubmodulesrun:|gitsubmoduleupdate--init--remotegitconfig--globaluser.name\"github-actions[bot]\"gitconfig--globaluser.email\"github-actions[bot]@users.noreply.github.com\"gitadd.gitcommit-m\"Updatesubmodules\"||echo\"ignorecommitfailure,proceed\"gitpush||echo\"ignorecommitfailure,proceed\"https://stackoverflow.com/questions/8123674/how-to-git-commit-nothing-without-an-errorYOURBUILDPROCESSHERE`","tags":" [\"Github Actions\"]"}]